Repository: BaselHegazi226/flutter_ecommerce_app_2025
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: EP
ar: ج.م

# nav_home
source: Home
ar: الرئيسية

# nav_search
source: Search
ar: البحث

# nav_cart
source: Cart
ar: السلة

# nav_profile
source: Profile
ar: الملف الشخصي

# home_welcome
source: Welcome,
ar: مرحبًا بك,

# home_categories
source: Categories
ar: الفئات

# home_app_products
source: App Products
ar: منتجات التطبيق

# home_showAll
source: Show All
ar: عرض الكل

# home_allProducts
source: All Products
ar: كل المنتجات

# home_category
source: Category
ar: الفئة

# home_rating
source: Rating
ar: التقييم

# home_details
source: Details
ar: التفاصيل

# home_price
source: Price
ar: السعر

# home_addToCart
source: Add To Cart
ar: أضف إلى السلة

# home_no_products_now
source: No Products available Now
ar: لا يوجد منتجات من هذا الصنف الآن

# home_not_categories_available_now
source: No Categories available now!
ar: لا توجد فئات متوفره الآن

# home_not_user_found
source: No User Data Found
ar: لا يوجد بيانات مستخدم متاحه الآن

# cart_checkout
source: Checkout
ar: إتمام الشراء

# cart_billing_address
source: Billing Address
ar: عنوان الفاتوره

# cart_total
source: Total
ar: الإجمالي

# cart_delivery
source: Delivery
ar: التوصيل

# cart_location
source: Location
ar: الموقع

# cart_summarize
source: Summarize
ar: الملخص

# cart_finish
source: Finish
ar: إنهاء

# cart_next
source: Next
ar: التالي

# cart_back
source: Back
ar: السابق

# cart_payment
source: Payment
ar: الدفع

# cart_nextDayDelivery
source: Next Day Delivery
ar: توصيل في اليوم التالي

# cart_nominatedDelivery
source: Nominated Delivery
ar: توصيل في موعد محدد

# cart_standardDelivery
source: Standard Delivery
ar: توصيل عادي

# cart_placeYourOrder
source: Place your order before 6pm and your items will be delivered the next day
ar: قم بطلبك قبل الساعة 6 مساءً ليتم التوصيل في اليوم التالي

# cart_placeYourOrder_result
source: Your order will reach before 6pm and your items will be delivered the next day
ar: طلبك سوف يصل اليوم التالي لو قمت بالطلب بعد 6 مساءً

# cart_pickAParticular
source: Pick a particular date from the calendar and order will be delivered on selected date
ar: اختر تاريخًا من التقويم ليتم التوصيل في هذا اليوم

# cart_pickAParticular_result
source: Your order will reach in
ar: طلبك سوف يصل في تاريخ

# cart_orderWillBe
source: Order will be delivered between 3 - 5 business days
ar: سيتم التوصيل خلال 3 إلى 5 أيام عمل

# cart_orderWillBe_result
source: Order will be delivered between 3 - 5 business days
ar: سيتم التوصيل خلال 3 إلى 5 أيام عمل

# calendar_title
source: Choose delivery date
ar: اختر تاريخ التوصيل

# calendar_cancel
source: Cancel
ar: إلغاء

# calendar_confirm
source: Confirm
ar: تأكيد

# cart_tryToFill
source: Try To Fill Cart
ar: حاول إضافة منتجات إلى السلة

# cart_alreadyInCart
source: This product is already added to the cart
ar: هذا المنتج مضاف بالفعل إلى السلة

# cart_delete_product_title
source: Delete Product
ar: حذف المنتج

# cart_delete_product_desc
source: Are you sure to delete product?
ar: هل انت متأكد من حذف هذا المنتج؟

# warning_button_title_ok
source: Ok
ar: موافق

# warning_button_title_Cancel
source: Cancel
ar: تراجع

# order_pending
source: Pending
ar: قيد الانتظار

# order_delivered
source: Delivered
ar: تم التسليم

# order_transmit
source: Transmit
ar: قيد الإرسال

# order_ready
source: Order is Ready To Make
ar: الطلب جاهز للتنفيذ

# order_cancel
source: Cancel Order
ar: إلغاء الطلب

# order_noLocation
source: No Location Found, try making an order!
ar: لم يتم العثور على عنوان، حاول إنشاء طلب

source: Order History
ar: سجل الطلبات

# order_history_no_found_orders
source: Not found order history now!
ar: لا يوجد سجل للطلبات حتى الآن

# order_delete
source: Delete
ar: حذف

# order_all
source: All
ar: الكل

# order_order_id
source: Order id
ar: رقم الطلب

source: From
ar: من

source: items
ar: العناصر

# order_total_price
source: Total Price
ar: السعر الإجمالي

# order_added_done
source: Is Already added
ar: تمت اضافه المنتج من قبل

# delete_order_history_title
source: Delete Order History
ar: حذف تاريخ الطلبات

# delete_order_description
source: Are you sure to delete all order history?
ar: هل انت متأكد من حذف تاريخ السجل بأكمله؟

# form_street1
source: Street 1
ar: الشارع 1

# form_street2
source: Street 2
ar: الشارع 2

# form_city
source: City
ar: المدينة

# form_state
source: State
ar: المحافظة

# form_country
source: Country
ar: الدولة

# form_countryRequired
source: Country is required
ar: الدولة مطلوبة

# form_enterCountry
source: Enter country
ar: أدخل الدولة

# form_stateRequired
source: State is required
ar: المحافظة مطلوبة

# form_enterState
source: Enter state
ar: أدخل المحافظة

# form_cityRequired
source: City is required
ar: المدينة مطلوبة

# form_enterCity
source: Enter city
ar: أدخل المدينة

# form_street1Required
source: Street 1 is required
ar: الشارع 1 مطلوب

# form_enterStreet1
source: Enter street 1
ar: أدخل الشارع 1

# form_street2Required
source: Street 2 is required
ar: الشارع 2 مطلوب

# form_enterStreet2
source: Enter street 2
ar: أدخل الشارع 2

# onboarding_title_img1
source: Discover Products With Smart Search
ar: اكتشف المنتجات ببحث ذكي وسريع

# onboarding_desc_img1
source: Easily find the products you are looking for Quick access to what matters most
ar: اعثر بسهولة على المنتجات التي تبحث عنها وصول سريع لما يهمك دون تعقيد

# onboarding_title_img2
source: Explore A Wide Product Collection
ar: تصفح مجموعة واسعة من المنتجات

# onboarding_desc_img2
source: Browse a diverse range of products Carefully selected to match every taste
ar: استكشف تشكيلة متنوعة من المنتجات مختارة بعناية لتناسب جميع الأذواق

# onboarding_title_img3
source: Secure And Simple Checkout Experience
ar: تجربة دفع آمنة وسلسة

# onboarding_desc_img3
source: Complete your payments safely and smoothly Multiple trusted payment options available
ar: أكمل عمليات الدفع بسهولة وأمان مع خيارات دفع متعددة وموثوقة

# onboarding_next
source: Next
ar: التالي

# onboarding_skip
source: Skip
ar: تخطي

# auth_email
source: Email
ar: البريد الإلكتروني

# auth_password
source: Password
ar: كلمة المرور

# auth_confirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور

# language_selected_text
source: Select Favourite Language
ar: اختر لغتك المفضله

# auth_name
source: Name
ar: الاسم

# auth_forgetPassword
source: Forgot password?
ar: هل نسيت كلمة المرور؟

# auth_or
source: Or
ar: أو

# auth_signIn
source: Sign In
ar: تسجيل الدخول

# auth_signInToContinue
source: Sign in to continue
ar: سجّل الدخول للمتابعة

# auth_signInWithGoogle
source: Sign in with Google
ar: الدخول باستخدام جوجل

# auth_signInWithFacebook
source: Sign in with Facebook
ar: الدخول باستخدام فيسبوك

# auth_signUp
source: Sign Up
ar: إنشاء حساب

# auth_signUpToContinue
source: Create an account to continue
ar: أنشئ حسابًا للمتابعة

# auth_nameRequired
source: Name is required
ar: الاسم مطلوب

# auth_emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# auth_passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# auth_enterValidName
source: Enter a valid name
ar: أدخل اسمًا صحيحًا

# auth_enterValidEmail
source: Enter a valid email (example@email.com)
ar: أدخل بريدًا إلكترونيًا صحيحًا

# auth_enterStrongPassword
source: Enter a strong password
ar: أدخل كلمة مرور قوية

# auth_passwordNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# success_login_title
source: Welcome back!
ar: مرحبًا بعودتك

# success_login_desc
source: You have logged in successfully. Enjoy your experience.
ar: تم تسجيل الدخول بنجاح، نتمنى لك تجربة ممتعة.

# success_register_title
source: Account Created
ar: تم إنشاء الحساب

# success_register_desc
source: Your account has been created successfully. You can start now.
ar: تم إنشاء حسابك بنجاح، يمكنك البدء الآن.

# success_addToCart_title
source: Success Added
ar: تمت الإضافة

# success_addToCart_desc
source: The product has been added to your cart successfully.
ar: تمت إضافة المنتج إلى السلة بنجاح.

# success_removeFromCart_title
source: Removed
ar: تمت الإزالة

# success_removeFromCart_desc
source: The product has been removed from your cart.
ar: تمت إزالة المنتج من السلة بنجاح.

# success_payment_title
source: Payment Successful
ar: تم الدفع بنجاح

# success_payment_desc
source: Your payment was completed successfully. Thank you!
ar: اكتملت عملية الدفع بنجاح، شكرًا لك.

# success_updateProfile_title
source: Profile Updated
ar: تم تحديث البيانات

# success_updateProfile_desc
source: Your account information has been updated successfully.
ar: تم تحديث بيانات حسابك بنجاح.

# success_removeFavorite_title
source: Removed from Favorites
ar: تمت الإزالة من المفضلة

# success_removeFavorite_desc
source: The product has been removed from your favorites.
ar: تمت إزالة المنتج من المفضلة بنجاح.

# success_clearFavorites_title
source: Favorites Cleared
ar: تم مسح المفضلة

# success_clearFavorites_desc
source: All favorite products have been removed successfully.
ar: تمت إزالة جميع المنتجات من المفضلة.

# success_removeOrder_title
source: Order Removed
ar: تم حذف الطلب

# success_removeOrder_desc
source: The order has been removed successfully.
ar: تم حذف الطلب بنجاح.

# success_cancelOrder_title
source: Order Cancelled
ar: تم إلغاء الطلب

# success_cancelOrder_desc
source: Your order has been cancelled successfully.
ar: تم إلغاء الطلب بنجاح.

# success_logout_title
source: Logged Out
ar: تم تسجيل الخروج

# success_logout_desc
source: You have logged out successfully. See you soon!
ar: تم تسجيل الخروج بنجاح، نراك قريبًا.

# success_add_order_title
source: Success Order
ar: نجح الطلب

# success_add_order_desc
source: Success Make Order make a lot!
ar: تم عمل الطلب بنجاح

# failure_login_title
source: Login Failed
ar: فشل تسجيل الدخول

# failure_register_title
source: Registration Failed
ar: فشل إنشاء الحساب

# failure_addOrder_title
source: Order Failed
ar: فشل إنشاء الطلب

# failure_payment_title
source: Payment Failed
ar: فشل الدفع

# failure_addToCart_title
source: Add to Cart Failed
ar: فشل إضافة المنتج

# failure_updateProfile_title
source: Update Failed
ar: فشل تحديث البيانات

# failure_updateProfile_desc
source: The data update failed due to some problems that may be related to the internet. Please try again!
ar: فشل تحديث البيانات بسبب بعض المشاكل التي ممكن ان تكون متعلقه بالأنترنت حاول مره اخرى من فضلك!

# error_connectionTimeout
source: Connection timeout. Please try again.
ar: انتهت مهلة الاتصال

# error_sendTimeout
source: Send timeout. Please try again.
ar: انتهت مهلة الإرسال

# error_receiveTimeout
source: Receive timeout. Please try again.
ar: انتهت مهلة الاستقبال

# error_connection
source: Connection error. Please check your internet.
ar: خطأ في الاتصال بالإنترنت

# error_unexpected
source: Unexpected error. Please try again.
ar: حدث خطأ غير متوقع

# error_unknownServer
source: Unknown server error.
ar: خطأ غير معروف في الخادم

# error_badRequest
source: Invalid request.
ar: طلب غير صالح

# error_unauthorized
source: Unauthorized. Please login again.
ar: غير مصرح، يرجى تسجيل الدخول

# error_forbidden
source: You don't have permission to perform this action.
ar: ليس لديك صلاحية

# error_notFound
source: Requested resource not found.
ar: العنصر غير موجود

# error_conflict
source: Conflict occurred.
ar: حدث تعارض

# error_internalServer
source: Internal server error.
ar: خطأ في الخادم

# error_networkRequestFailed
source: Network error. Please check your connection.
ar: خطأ في الشبكة

# error_tooManyRequests
source: Too many requests. Try again later.
ar: طلبات كثيرة جدًا

# error_userNotFound
source: User not found.
ar: المستخدم غير موجود

# error_wrongPassword
source: Wrong password.
ar: كلمة المرور غير صحيحة

# error_emailAlreadyInUse
source: This email is already in use.
ar: البريد مستخدم بالفعل

# error_invalidEmail
source: Invalid email address.
ar: بريد غير صالح

# error_weakPassword
source: Weak password.
ar: كلمة المرور ضعيفة

# error_operationNotAllowed
source: Operation not allowed.
ar: العملية غير مسموحة

# error_userDisabled
source: User account disabled.
ar: تم تعطيل الحساب

# error_requiresRecentLogin
source: Please login again.
ar: يرجى تسجيل الدخول مرة أخرى

# error_invalidVerificationCode
source: Invalid verification code.
ar: رمز التحقق غير صحيح

# error_invalidVerificationId
source: Invalid verification ID.
ar: معرف التحقق غير صالح

# error_unknownFirebase
source: Unknown error occurred.
ar: حدث خطأ غير معروف

source: Profile
ar: الملف الشخصي

# profile_edit
source: Edit Profile
ar: تعديل الملف الشخصي

# profile_update_title_button
source: Update Profile
ar: تحديث ملفك

# profile_shippingAddress
source: Shipping Address
ar: عنوان الشحن

# profile_no_shipping_address
source: No Location Found try make order!
ar: لا يوجد عنوان شحن تم ادخاله

# profile_favourite
source: Favourite
ar: المفضلة

# profile_noFavourite
source: No Favourite Item Found
ar: لا توجد عناصر مفضلة

# profile_delete_favourite_Item_title
source: Delete Item
ar: حذف العنصر

# profile_delete_favourite_Item_desc
source: Are you sure to delete item from favourite products
ar: هل تريد بالفعل حذف العنصر من المفضله

# profile_userName
source: User Name
ar: اسم المستخدم

# profile_userEmail
source: User Email
ar: البريد الإلكتروني

# profile_logout_title
source: Logout
ar: تسجيل الخروج

# profile_logout_desc
source: Are you sure to logout?
ar: هل تريد بالفعل تسجيل الخروج من حسابك؟

# settings_title
source: Settings
ar: الإعدادات

# settings_notifications
source: Notifications
ar: الإشعارات

# settings_mode
source: Mode
ar: الوضع

# settings_language
source: Language
ar: اللغة

# settings_onOff
source: On / Off
ar: تشغيل / إيقاف

# settings_dark
source: Dark
ar: داكن

# settings_light
source: Light
ar: فاتح

# settings_logout
source: Logout
ar: تسجيل الخروج

# category_beauty
source: Beauty
ar: الجمال

# category_fragrances
source: Fragrances
ar: العطور

# category_furniture
source: Furniture
ar: الأثاث

# category_groceries
source: Groceries
ar: البقالة

# category_home_decoration
source: Home Decoration
ar: ديكور المنزل

# category_kitchen_accessories
source: Kitchen Accessories
ar: مستلزمات المطبخ

# category_laptops
source: Laptops
ar: أجهزة لابتوب

# category_mens_shirts
source: Men's Shirts
ar: قمصان رجالي

# category_mens_shoes
source: Men's Shoes
ar: أحذية رجالي

# category_mens_watches
source: Men's Watches
ar: ساعات رجالي

# category_mobile_accessories
source: Mobile Accessories
ar: إكسسوارات الموبايل

# category_motorcycle
source: Motorcycle
ar: دراجات نارية

# category_skin_care
source: Skin Care
ar: العناية بالبشرة

# category_smartphones
source: Smartphones
ar: هواتف ذكية

# category_sports_accessories
source: Sports Accessories
ar: مستلزمات رياضية

# category_sunglasses
source: Sunglasses
ar: نظارات شمس

# category_tablets
source: Tablets
ar: أجهزة لوحية

# category_tops
source: Tops
ar: ملابس علوية

# category_vehicle
source: Vehicle
ar: مركبات

# category_womens_bags
source: Women's Bags
ar: حقائب نسائية

# category_womens_dresses
source: Women's Dresses
ar: فساتين نسائية

# category_womens_jewellery
source: Women's Jewellery
ar: مجوهرات نسائية

# category_womens_shoes
source: Women's Shoes
ar: أحذية نسائية

# category_womens_watches
source: Women's Watches
ar: ساعات نسائية

# about_me_title
source: About me
ar: نبذه عني

# about_me_summary
source: Summary
ar: ملخص لما اقدمه

# about_me_desc
source: I am a Flutter Mobile Developer specialized in building high-performance cross-platform applications for Android and iOS using a single codebase. I focus on clean, scalable architectures and delivering smooth, user-friendly experiences. I have solid experience working with Firebase, REST APIs, and state management using Bloc/Cubit, with strong attention to detail and writing maintainable, production-ready code.
ar: أنا مطور تطبيقات موبايل متخصص في Flutter، أعمل على بناء تطبيقات عالية الأداء تعمل على Android و iOS من كود واحد، مع التركيز على Clean Architecture، تجربة مستخدم سلسة، وكود قابل للتوسع والصيانة. لدي خبرة قوية في التعامل مع Firebase، REST APIs، وإدارة الحالة باستخدام Bloc/Cubit، مع اهتمام كبير بالتفاصيل وتحويل التصاميم إلى واجهات احترافية ومتجاوبة.

# about_me_technical_skills
source: Technical Skills
ar: مهاراتي التقنية

# about_me_apps_development
source: Apps I Can Build
ar: أنواع التطبيقات التي أستطيع تطويرها

# about_me_skill_state_management
source: State Management (Bloc / Cubit)
ar: إدارة الحالة (Bloc / Cubit)

# about_me_skill_rest_api
source: Working with REST APIs & Dio
ar: التعامل مع REST APIs و Dio

# about_me_skill_architecture
source: Clean Architecture & MVVM
ar: Clean Architecture و MVVM

# about_me_skill_responsive_ui
source: Responsive & Adaptive UI Design
ar: تصميم واجهات متجاوبة

# about_me_skill_localization
source: Localization (Arabic / English)
ar: دعم اللغتين العربية والإنجليزية

# about_me_skill_git
source: Git & GitHub
ar: Git و GitHub

# about_me_skill_custom_ui
source: Custom UI Components & Performance Optimization
ar: إنشاء واجهات مخصصة وتحسين الأداء

# about_me_app_ecommerce
source: E-commerce Applications
ar: تطبيقات التجارة الإلكترونية

# about_me_app_management
source: User & Employee Management Apps
ar: تطبيقات إدارة المستخدمين والموظفين

# about_me_app_chat
source: Chat & Messaging Applications
ar: تطبيقات الدردشة والمراسلة

# about_me_app_content
source: Content-based Applications (News – Blogs – Products)
ar: تطبيقات عرض المحتوى (أخبار – مدونات – منتجات)

# about_me_app_firebase
source: CRUD Applications with Firebase
ar: تطبيقات CRUD مرتبطة بـ فاير بيز

# about_me_app_api
source: API-driven Mobile Applications
ar: تطبيقات تعتمد على APIs خارجية

# about_me_app_admin
source: Admin Dashboards (Admin Panels)
ar: لوحات تحكم (Admin Panels)
